my-recommendations-backend/app/controllers/books_controller.rb

	def index
		books = Book.all
---
SELECT "books".* FROM "books"

	def show
		book = Book.find_by_id(params[:id])
---
SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

	def update
		book = Book.find_by_id(params[:book_id])
		book.update(params.require(:book).permit(:favorite, :read_status, :rating))
---
SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "books" SET "read_status" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["read_status", 0], ["updated_at", "2020-07-19 07:08:52.983554"], ["id", 1]]

	def create
		book = Book.new(params.require(:book).permit(:title, :author, :genre, :description, :image, :rating, :favorite, :read_status))
		book.save
---
INSERT INTO "books" ("title", "author", "genre", "description", "created_at", "updated_at", "image", "rating", "favorite", "read_status") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)