my-recommendations-backend/app/controllers/reviews_controller.rb

	def index
		reviews = Review.all
---
SELECT "reviews".* FROM "reviews"

	def create
		review = Review.new(params.permit(:book_id, :review))
		review.save
---
INSERT INTO "reviews" ("review", "created_at", "updated_at", "book_id") VALUES (?, ?, ?, ?)  [["review", "Great Book!"], ["created_at", "2020-07-21 04:43:49.545046"], ["updated_at", "2020-07-21 04:43:49.545046"], ["book_id", 2]]